
--seeds
INSERT INTO
    areas (name)
VALUES
    ('Al Sheikh zayed'),
    ('Al mohandseen');

INSERT INTO
    car_brands (name)
VALUES
    ('Toyota'),
    ('Mercides'),
    ('Hyundai');

INSERT INTO
    car_brand_models (name, years, car_brand_id)
VALUES
    (
        'Corolla',
        '2010,2011,2012,2013,2014,2015,2016,2017,2018,2019',
        1
    ),
    (
        'Camry',
        '2010,2011,2012,2013,2014,2015,2016,2017,2018,2019',
        1
    ),
    (
        'Elentra',
        '2010,2011,2012,2013,2014,2015,2016,2017,2018,2019',
        2
    ),
    (
        'Tucson',
        '2010,2011,2012,2013,2014,2015,2016,2017,2018,2019',
        2
    ),
    (
        'C200',
        '2010,2011,2012,2013,2014,2015,2016,2017,2018,2019',
        3
    ),
    (
        'E200',
        '2010,2011,2012,2013,2014,2015,2016,2017,2018,2019',
        3
    );

INSERT INTO
    centers (
        name,
        phone,
        location,
        address,
        area_id,
        lat,
        long
    )
VALUES
    (
        'GB Auto - Hyundai - El Sheikh Zayed',
        '01207661993',
        '3X64+5W قسم الشيخ زايد',
        'خلف الهاييبر وان بجوار امريكانا بلازا - الحى الاول شارع الروضة امام كليه, الهندسة, Giza, الجيزة',
        1,
        '30.03735564',
        '31.01083698'
    ),
    (
        'مركز صيانة هيونداى Hyundai Service Center',
        '01006888826',
        '3X64+5W قسم الشيخ زايد',
        'بوابه, 8 بيفرلى هيلز، الجيزة 12588',
        1,
        '30.06500699',
        '30.95729685'
    ),
    (
        'GB Auto - Hyundai - Abo Rawash - Showroom, Service Center & spare parts',
        '0235366010',
        '329P+4X قسم الشيخ زايد',
        'ابورواش 28 طريق القاهرة الاسكندرية الصحراوى - المنطقة الصناعية الثانية - طريق ال, Abu Rawash, الجيزة',
        1,
        '30.067845596254937',
        '31.03740789'
    ),
    (
        'Wahdan Auto Group',
        '0238204410',
        'WV7W+J2 قسم ثان 6 أكتوبر',
        'المنطقة الصناعية الثالثة، السادس من اكتوبر، الجيزة، 3221732',
        1,
        '29.914065410175006',
        '30.89492614'
    ),
    (
        'مركز عربيتي',
        '01157555959',
        '2XV7+CR قسم الشيخ زايد',
        'رقم 45، قسم الشيخ زايد، الجيزة 3242803',
        1,
        '30.043544240746243',
        '30.96450447'
    );

INSERT INTO
    "winch" (
        "area_id",
        "name",
        "phone",
        "driver_name",
        "driver_phone"
    )
VALUES
    (
        1,
        'Winch 1',
        '1234567890',
        'Driver 1',
        '1234567890'
    ),
    (
        1,
        'Winch 2',
        '1234567890',
        'Driver 2',
        '1234567890'
    ),
    (
        1,
        'Winch 3',
        '1234567890',
        'Driver 3',
        '1234567890'
    ),
    (
        2,
        'Winch 4',
        '1234567890',
        'Driver 4',
        '1234567890'
    ),
    (
        2,
        'Winch 5',
        '1234567890',
        'Driver 5',
        '1234567890'
    );
